Revit 2026 API

# DocumentGetAllUnusedElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ISet<ElementId> GetAllUnusedElements(
	ISet<ElementId> categories
)
```
```vb
Public Function GetAllUnusedElements (
	categories As ISet(Of ElementId)
) As ISet(Of ElementId)
```
```cpp
public:
ISet<ElementId^>^ GetAllUnusedElements(
	ISet<ElementId^>^ categories
)
```
```fsharp
member GetAllUnusedElements :
        categories : ISet<ElementId> -> ISet<ElementId>
```

#### Parameters

categories ISetElementId

#### Return Value

ISetElementId

#### Reference

Document Class

Autodesk.Revit.DB Namespace